import * as Yup from 'yup';

export const contactsSchema = Yup.object().shape({
	email: Yup.string()
		.email('Введіть коректну e-mail адресу')
		.max(50, 'Максимальна кількість символів 50')
		.matches(
			/^[A-Z0-9_%+-]+(\.[A-Z0-9_%+-]+)*@[A-Z0-9.-]+\.[A-Z]{2,4}$/i,
			'Введіть коректну e-mail адресу'
		)
		.required("Обов'язкове поле"),
	facebook: Yup.string()
		.max(500, 'Максимальна кількість символів 500')
		.min(2, 'Поля повинні мати більше 2 символів')
		.matches(/^https:\/\/.*/, 'URL повинен починатися з https://')
		.required("Поле обов'язкове до заповнення. Введіть посилання"),
	instagram: Yup.string()
		.max(500, 'Максимальна кількість символів 500')
		.min(2, 'Поля повинні мати більше 2 символів')
		.matches(/^https:\/\/.*/, 'URL повинен починатися з https://')
		.required("Поле обов'язкове до заповнення. Введіть посилання"),
	phone_first: Yup.string()
		.max(18, 'Невірний формат телефону. Правильний формат: +38 ### ### ## ##')
		.matches(/^\+38 \d{3} \d{3} \d{2} \d{2}$/, 'Невірний формат номеру. Приклад: +38 ### ### ## ##')
		.required("Поле обов'язкове"),
	phone_second: Yup.string()
		.max(18, 'Невірний формат телефону. Правильний формат: +38 ### ### ## ##')
		.matches(/^\+38 \d{3} \d{3} \d{2} \d{2}$/, 'Невірний формат номеру. Приклад: +38 ### ### ## ##')
		.required("Поле обов'язкове"),
	post_address: Yup.string(),
});
